

//单片机型号：STC15W408AS 
//	电压	：3.3V 
//内部RC振荡：11.0592M



#include "STC15F2K60S2.H"
#include "ad9833.h"



sbit LED = P5^5;



/*
*********************************************************************************************************
*	函 数 名: DelayMs
*	功能说明: 时钟延时
*	形    参: ms 以毫秒为单位.
*	返 回 值: 无
*********************************************************************************************************
*/
void DelayMs( unsigned int ms)
{
	unsigned int i,j;
	for (i = 0; i < ms; i++)
		for(j=0;j<1074;j++);
}



void main()
{



/*  AD9833_WaveSeting(1234.5,0,TRI_WAVE,0 );//1.2345KHz,频率寄存器0，三角波输出 ,初相位0*/
/*	AD9833_WaveSeting(5000,0,SQU_WAVE,90);	//5KHz,		频率寄存器0，方波输出 	,初相位90 */
	AD9833_WaveSeting(2000.0,0,SIN_WAVE,0 );//2KHz,	频率寄存器0，正弦波输出 ,初相位0 
    AD9833_AmpSet(200);	//设置幅值，幅值最大 255
	while(1)
	{
		LED = !LED; //LED1 取反 
		DelayMs(100);	   //延时 100ms
	}
	
}




